const keep_alive = require('./keep_alive.js')
let Discord = require("discord.js");
let client = new Discord.Client();

client.on("ready", () => {
  client.user.setActivity("קורס פייתון דיגיטלי", { type: "WATCHING" });
});

client.on("message", (message) => {
  if (message.mentions.users.has(client.user.id)) {
    let answers = [
    "כשאתה רואה שגיאה בקוד, נסה לקרוא לו 'חמור שופך קפה' במקום להתרגז. זה ישפר את המצב הרוח שלך וגם יעזור לך למצוא את הטעות.",
      "אם אתה מסתבך עם קוד מורכב, נסה להוסיף כמה צבעוניות לקוד שלך. אולי זה יקנה לך את הרוח וגם יסייע לך להבין אותו יותר טוב.",
      "כשאתה רוצה להוסיף תכונה חדשה לקוד שלך, נסה להוסיף כמה קצת מגנטים בקוד שלך. זה יקנה לך את הרוח וגם יוסיף משהו מעניין לקוד שלך.",
      "כשאתה רוצה להוסיף קטע חדש לקוד שלך, נסה לחשוב על זמן שבו היה לך יותר קל להוסיף אותו. זה יסייע לך להבין טוב יותר איפה הבעיה בקוד שלך.",
      "כשאתה לא בטוח מה לעשות עם הקוד שלך, נסה לשאול את הצמח שלך לעצה. זה יכול להיגמר טוב, ואולי גם תקבל תגובה חיובית מהצמח שלך.",
      "אם אתה מרגיש שהקוד שלך נראה מאוד מורכב, נסה להוסיף כמה חתולים דמיוניים בקוד שלך. זה יקנה לך את הרוח וגם יוסיף משהו מעניין לקוד שלך.",
      "כשאתה רואה שגיאה בקוד, נסה לקרוא לו 'באן מפלצות' במקום להתרגז. זה ישפר את המצב הרוח שלך וגם יעזור לך למצוא את הטעות.",
      "כשאתה מתקשה לפתור בעיה בקוד, נסה לדמות שאתה מקבל קפה ומשוחח עם הקוד. אולי זה יפתור את הבעיה בקלות יותר.",
      "אם אתה לא בטוח איך לתקן את הבעיה בקוד, נסה לשאול חבר או חברה לעזרה. אולי יש להם רעיון חדש שיעזור לך.",
      "כשאתה רוצה לשפר את הקוד שלך, נסה לגשת אליו עם נימוק חזק יותר. זה יכול לעזור לך לראות את התוצאות שאתה מחפש.",
      "כשאתה עובד על קוד מורכב, נסה להוסיף כמה דמויות אנימציה. זה יעשה את העבודה שלך קלה יותר וגם תוסיף קצת דרמה לקוד שלך.",
      "כאשר אתה מתקשה להבין את הקוד שלך, נסה לפגוש את הקוד באופן פנים אל פנים. זה יעזור לך להתרגש מהקוד ולראות את האתגר בצורה אחרת.",
      "כשאתה רואה שגיאה בקוד, נסה לדמות שאתה מתקן את הקפה. זה יסייע לך לשמור על המצב הרוח שלך וגם יקל עליך לפתור את הבעיה.",
      "כאשר אתה מתקשה להבין איך להגיב לשגיאה בקוד, נסה לחשוב על מה יעשה אותך לחיוך. זה יסייע לך לעבור את המצב הרוח שלך ולמצוא פתרונות יותר יצירתיים.",
      "כשאתה רואה שגיאה בקוד, נסה לקרוא לה 'איילת שמן'. יכול להיות שתתקל בתשובה אינטואיטיבית שתעזור לך לפתור את הבעיה.",
      "כשאתה עובד על קוד מורכב, נסה להוסיף כמה צבעוניות וחסרון עם נפש לקוד שלך. אולי זה יעזור לך להבין את הבעיה בצורה שונה.",
      "כאשר אתה מתקשה להבין את הקוד שלך, נסה לדמות שאתה משחק במשחק פאזלים. זה יעזור לך לראות את החלקים של הקוד כקולקציה של חלקים קטנים.",
       "כשאתה מרגיש שאתה נתקע עם הקוד, נסה לעצור לרגע ולשתות משהו. לפעמים הרעיון הטוב ביותר מגיע אחרי הפסקה.",
      "אם אתה מבולבל עם הקוד, נסה להגיד 'אלפבית'. לא יקרה דבר רע ואולי תזכור פתרון לבעיה שהתקשית עליה.",
      "כשאתה לא בטוח מה עושה הפונקציה הזו, נסה לקרוא לה 'חברה'. לא תקבל ממנה מענה, אבל ייתכן ותתברר לך הרבה מהפרות שלך.",
      "כשאתה רואה קוד מורכב מדי, נסה להפוך את זה לפונקציות קטנות יותר. יותר קל לנהל פונקציות קטנות מאשר קוד ארוך.",
      "כשאתה לא מצליח להבין את השגיאה, נסה לקרוא לה 'חידה'. זה יכול לעזור לך לראות אותה מזווית שונה ולפתור אותה בקלות יותר.",
      "אם אתה רואה שהקוד שלך לא עובד, נסה לקרוא לו 'סוסים דמיוניים'. כמה סוסים בשדה עשויים לשנות את המצב הרוח שלך.",
      "כשאתה מרגיש כי הקוד שלך מבלבל, נסה להגיד 'בית חול'. אולי תזכור את הרעיון שזה נגרם לך לראש בימי הילדות.",
      "כשאתה לא בטוח מה הפונקציה עושה, נסה להתאים אותה לדוברים עם כינויים. זה יכול לסייע לך להבין אותה טוב יותר.",
      "כשאתה רואה קוד מורכב מדי, נסה להפוך את זה לפונקציות קטנות יותר. הם יקלו עליך לנהל את הקוד ולפתור בעיות.",
      "כשאתה לא מצליח להבין את השגיאה, נסה לקרוא לה 'קסם'. זה יכול לעזור לך להבין אותה מזווית שונה ולפתור אותה בקלות יותר."
    ];
    message.channel.send(
      `${answers[Math.floor(Math.random() * answers.length)]}`,
    );
  }
});

client.login(process.env.TOKEN);
