const keep_alive = require('./keep_alive.js')
let Discord = require("discord.js");
let client = new Discord.Client();

client.on("ready", () => {
  client.user.setActivity("לצמוח או לנבול", { type: "WATCHING" });
});

client.on("message", (message) => {
  if (message.mentions.has(client.user)) {
    let answers = [
      "סבתי ז״ל תמיד אהבה לספר לי סיפורים על הילדות שלה בקיבוץ. היא סיפרה לי על החוויות המרתקות שהיא חוותה עם חבריה בחוות התינוקות ועל המשימות היומיומיות שלה בחקלאות. זה תמיד היה כל כך מרתק לשמוע על החיים בעיירה הקטנה ההיא בתחילת שנות החמישים.",
      "הרגע האהוב עליי היה כאשר הצלחתי לבנות בסוף הקיץ את המחצבה שתמיד רציתי. הייתי מתרגשת כל כך ומרגישה שהגעתי לשיא היצירתיות שלי.",
      "ביום ההולדת השבעים של סבתא שלי, כל המשפחה נקבצה למסיבת חגיגה גדולה בגן הבית שלה. זה היה חוויה מרגשת לראות אותה כל כך מאושרת ומוקירה על כל השנים של נתינה ואהבה.",
      "כאשר הגעתי לאוסטרליה לטיול של שבועיים, הייתי נשארת מדהימה מהיופי הטבעי של המקום. הטיול במדבר והפסגות הסוחפות בעיקר השאירו את התחושה של קסם מוחלט.",
      "כאשר הייתי בחופשה ביוון, התפעלתי מהיופי האדיר של האיים היווניים. כל ערב הייתי שוכבת על החוף ומסתכלת על השקיעה המרהיבה, מרגישה שזה הרגע שבו העולם נעצר ואני חלק ממנו.",
      "בסופש שבו חגגנו את יום הולדתה של אמא, היא הפתיעה אותנו עם טיול לפארק מים. זה היה יום משפחתי מדהים, שבו נהנינו מהרפתקאות במגלשות והתרגשנו יחד כל היום.",
      "בימי הקיץ בילדותי, כשהורי היו עובדים, הייתי נכנסת ליער הסמוך לבית ושם הייתי נשארת עד שהם חזרו מהעבודה. זה היה זמן שקט ורגוע שבו יכולתי להתבודד עם הטבע ולחשוב.",
      "כשהייתי בסיבוב של טיולים באירופה, תמיד נהגתי להשאיר את היום האחרון לביקור ביערות הכפרים של צפון איטליה. הייתי מתרגשת כל כך לראות את הנופים היפים והקסומים של האזור הזה.",
      "כאשר הייתי בטיול בגורן הגדול, התלהבתי מהנופים המרהיבים של הנחלים והמצוקים. זה היה חוויה מדהימה שהשאירה בי רוגע ושקט.",
      "פעם בחופשת הקיץ, כאשר נסענו לשבוע בצפון הארץ, עשינו טיול בטיילת של חופי נחל עמוד. זה היה חוויה פנומנלית שהשאירה בי רוגע ושלווה ללא דופי.",
      "בימי החורף, כאשר נסענו לטיול בהרי הגליל, אהבתי לקחת טיולים בסביבת הכפרים ולראות את הנופים הבהירים והנקיים. זה היה זמן של רוגע ושלווה שבו נהניתי מכל רגע.",
      "פעם ראשונה שהתעוררתי בצימר בצפון, נשארתי נשקפת מהיופי של הנופים ממש על פתח הדלת. זה היה רגע קסום שאף פעם לא אשכח.",
      "בחופשת הקיץ, כאשר נסענו למחנה בים, אהבתי לצאת לטיולים רגליים עם החברים ולראות את השקיעה מעל הים התיכון. זה היה זמן של רוגע ושקט שנהניתי מכל רגע.",
      "פעם ראשונה שהגעתי לחוויית רכיבה על סוסים בדרום, נהנתי מכל רגע של הנסיעה ביערות ובפריפריה. הייתי נושקת בזמן שהסוסים רודפים אחרי הנתיב בין העצים.",
      "בכל פעם שהייתי במסיבת יום הולדת של חברים בפארק המים, הרגשתי כאילו הכל מתאים והחברים מענגים מאוד. זה היה זמן של כיף ושמחה שבו נהניתי מכל רגע.",
      "בימי החופשה באירועי גן החיות, הייתי נהנית כל כך לראות את החיות במעגל וביציע. זה היה זמן של חיבור עם הטבע ועם החיות שבו נהניתי מכל רגע.",
      "בכל פעם שהייתי באוצרות הטבע באילת, נהנתי לחקור את השמש הזורמת על הים ולראות את המפלים הגדולים. זה היה זמן של רוגע ושלווה שבו נהניתי מכל רגע.",
      "כאשר הייתי בחופשת קיץ בים המלח, נהנתי לראות את הים המתים מהבריכה ולהתרענן מהשיחים היפים והמרשימים. זה היה זמן של כיף ושלווה שבו נהניתי מכל רגע.",
      "בכל פעם שהייתי במרחקי הקרוב מהים, נהנתי לצאת לטיולים בחופשות כדי להתרענן מהאווירה הים ולהתחבר לטבע. זה היה זמן של שלווה והנאה מכל רגע.",
      "בחופשת הקיץ בצפון הארץ, נהנתי לטייל בפארק הלאומי גן הנעורים ולראות את הפריחה הנפלאה של הפרחים שם. זה היה זמן של חיבור עם הטבע ועם החיות שבו נהניתי מכל רגע.",
      "פעם ראשונה שהגעתי לנחלי דן בחופשת הקיץ, נהנתי מהנופים המרהיבים של המעיינות והמסעדות הנעימות של המקום. הייתי נושקת על פתח הדלת ומתלהבת מכל רגע."
    ];
    message.channel.send(
      `${answers[Math.floor(Math.random() * answers.length)]}`,
    );
  }
});

client.login(process.env.TOKEN);
